app/controllers/students_controller.rb

  def show
    p Student.first
    #binding.pry
    puts "Allo ---------------------------------------"
    @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]